Revit 2026 API

# NumberingSchemaSchemaType Property

---

Identifies the kind of elements/objects this numbering schema is used for.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public NumberingSchemaType SchemaType { get; }
```
```vb
Public ReadOnly Property SchemaType As NumberingSchemaType
	Get
```
```cpp
public:
property NumberingSchemaType^ SchemaType {
	NumberingSchemaType^ get ();
}
```
```fsharp
member SchemaType : NumberingSchemaType with get
```

#### Property Value

NumberingSchemaType

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace